const mdList = {
  "c": {
    "desc": "学校内C, C++学习以及计算机系统基础相关知识及代码",
    "list": [
      {
        "title": "C++2016上机题及咸鱼代码",
        "desc": "本人C++水平较差,若嫌弃则只看题目即可",
        "time": "2017-04-22 17:49:25"
      },
      {
        "title": "ICS2017-Programming-Assignment-2-2-2-3",
        "desc": "PA2.2 程序，运行时的环境与AM",
        "time": "2018-05-06 00:39:45"
      },
      {
        "title": "从\"零\"开始: Spring-MVC",
        "desc": "该系列博客由我的同学汤茂行独立完成，仅在这里提供链接，欢迎访问",
        "time": "2018-05-06 09:48:44"
      },
      {
        "title": "计算机组成-程序的转换及机器级表示",
        "desc": "AT&T语法格式表示为:opcode src, dest: \"操作码 源, 目标\"",
        "time": "2018-05-05 11:46:24"
      },
      {
        "title": "嵌入式汇编基础题",
        "desc": "一些汇编的基础题目进行整理，加深自己的理解",
        "time": "2018-11-13 23:33:21"
      }
    ]
  },
  "react": {
    "desc": "React使用，相关项目以及框架源码阅读",
    "list": [
      {
        "title": "Parcel上手与React开发环境搭建",
        "desc": "我从不关注代码之外的东西，因为我相信有人会帮我做这些...",
        "time": "2018-03-25 21:22:56"
      },
      {
        "title": "React-Native实现NbaApp",
        "desc": "本项目为react-native构建的Nba App",
        "time": "2018-03-13 15:53:22"
      },
      {
        "title": "React源码自阅读(长篇)",
        "desc": "准备有时间写一个类react的框架，所以先读一下react的源码",
        "time": "2018-04-18 22:33:29"
      },
      {
        "title": "React生命周期简明宝典",
        "desc": "React的生命周期是我们掌握React工作过程所必须掌握的知识，同时也是部分公司的面试考点",
        "time": "2018-03-16 16:07:16"
      },
      {
        "title": "深入React知识点",
        "desc": "在这里对React的一些知识点进行一些总结，顺便提一下ReactNative方面的知识",
        "time": "2018-03-28 23:39:03"
      },
      {
        "title": "自写一个react-like项目",
        "desc": "项目使用了transform-react-jsx来进行JSX和JS的转换",
        "time": "2018-04-22 23:40:24"
      },
      {
        "title": "个人博客React重构开发记录",
        "desc": "之前的博客一直是hexo的，一个主题用腻了就要去找别的主题，并且改起来很麻烦，身为一个前端当然要自己撸一个博客了，于是就花了几天时间重构了一下博客",
        "time": "2018-10-21 00:39:11"
      }
    ]
  },
  "javascript": {
    "desc": "原生Javascript或NodeJs相关",
    "list": [
      {
        "title": "Immutable中的持久化数据结构",
        "desc": "可持久数据结构主要指的是我们可以查询历史版本的情况并支持插入，利用使用之前历史版本的数据结构来减少对空间的消耗",
        "time": "2018-09-27 20:17:07"
      },
      {
        "title": "函数节流-防抖区别与应用",
        "desc": "之前整理过一篇《JS高级技巧(简洁版)》，被评论吐槽了一波节流和防抖(红宝书把节流和防抖名字弄反了)，后来研究了一波不过没改原文，今天想起来就新开一篇文章讲一下",
        "time": "2018-09-19 22:00:00"
      },
      {
        "title": "async-await通读",
        "desc": "async 函数是 Generator 函数的语法糖。使用 关键字 async 来表示",
        "time": "2018-07-19 22:34:09"
      },
      {
        "title": "express-koa-redux三者中间件对比",
        "desc": "这三者对各自的中间件有着不同的实现，作者本人对此也比较好奇，在这里小小的研究一下源码，探究三者之间的异同",
        "time": "2018-09-14 00:12:55"
      },
      {
        "title": "Javascript引擎之属性访问优化",
        "desc": "JS内存空间分为栈(stack)、堆(heap)、池(一般也会归类为栈中)",
        "time": "2018-06-24 23:03:48"
      },
      {
        "title": "JavaScript设计模式",
        "desc": "保证一个类仅有一个实例，并提供一个访问它的全局访问点。实现的方法为先判断实例存在与否...",
        "time": "2018-04-12 20:00:41"
      },
      {
        "title": "Js技术题自写",
        "desc": "写一个方法，在一个未知对象中，找出所有的“李鹏”,并console.log输出",
        "time": "2018-06-07 17:04:19"
      },
      {
        "title": "MVC-MVVM-MVP",
        "desc": "MVC是模型(Model)－视图(View)－控制器(Controller)的缩写，是设计模式中最常用的软件架构",
        "time": "2018-04-16 16:03:31"
      },
      {
        "title": "Promise精读",
        "desc": "new Promise( function(resolve, reject) {...} /* executor */  );",
        "time": "2018-07-19 23:43:41"
      },
      {
        "title": "JS高级技巧(简洁版)",
        "desc": "在JS中，所有的函数都是对象，所以使用函数指针十分简单，也是这些东西使JS函数有趣且强大",
        "time": "2018-05-07 19:32:10"
      },
      {
        "title": "关于页面切换后setInterval出现延时问题",
        "desc": "今天没事在写3D粒子动画的时候，设置了一个延时器让粒子变换不同的样子..就像这样",
        "time": "2018-06-08 21:00:53"
      },
      {
        "title": "和setImmediate那销魂的一夜情",
        "desc": "This method is used to break up long running operations and run a callback function immediately after the browser has completed other operations such as events and display updates",
        "time": "2018-03-27 19:49:08"
      },
      {
        "title": "纯前端实现Gif制作",
        "desc": "开始没有任何头绪，想着去别人源码那copy一下，发现根本用不上...",
        "time": "2018-03-24 22:44:27"
      },
      {
        "title": "自写npm包汇总",
        "desc": "If you just want to quickly build a project which support react and sass and without any configurations，you can use this cli.",
        "time": "2018-09-10 20:51:16"
      },
      {
        "title": "软件杯H5端视频尬舞机开发记录",
        "desc": "自己还没接触过这方面的开发，所以准备写一篇博客长期跟踪这个项目了",
        "time": "2018-06-15 21:25:48"
      },
      {
        "title": "Node异步IO与编程",
        "desc": "Node.js让Javascript在服务器端焕发生机",
        "time": "2018-10-29 16:25:03"
      },
      {
        "title": "Node进程与进程间通信",
        "desc": "Node是在V8引擎上构建的，这就导致Javascript运行在单个进程的单个线程上，它带来了好处是：程序状态单一，在没有多线程的情况下没有锁，线程同步的问题，系统在调度时候较少的上下文切换，很好的提高CPU的使用率",
        "time": "2018-11-25 16:18:50"
      },
      {
        "title": "Super及其在React中的使用",
        "desc": "super这个函数，本萌新虽然经常接触(因为每次在React中Class的构造函数中第一行就是这个东西)，但是一直没有研究一下为什么？？？",
        "time": "2018-12-03 23:25:57"
      },
      {
        "title": "Node内存控制",
        "desc": "基于无阻塞，事件驱动建立的Node服务，具有内存消耗低的优点，非常适合处理海量的网络请求，那么在Node中是如何高效的使用内存的呢？",
        "time": "2018-12-11 21:43:47"
      },
      {
        "title": "你觉得自己实现一个Promise很简单么",
        "desc": "实现之前我觉得很简单，然后我就后悔了",
        "time": "2018-12-15 22:30:06"
      },
      {
        "title": "我不知道的Let",
        "desc": "关于const在本文中部分与let相似，具体情况请独立判断",
        "time": "2019-01-06 10:17:10"
      }
    ]
  },
  "package": {
    "desc": "Webpack等打包工具学习及实践",
    "list": [
      {
        "title": "create-react-app的webpack配置阅读",
        "desc": "你构建项目用webpack么? 不, 我用parcel",
        "time": "2018-05-15 00:11:07"
      },
      {
        "title": "Parcel上手与React开发环境搭建",
        "desc": "我从不关注代码之外的东西，因为我相信有人会帮我做这些...",
        "time": "2018-03-25 21:22:59"
      },
      {
        "title": "Webpack配置讲解",
        "desc": "之前讲了讲Parcel搭建React环境...想了想不讲一哈Webpack还真有点过意不去",
        "time": "2018-03-28 21:43:27"
      },
      {
        "title": "博客前端优化小记",
        "desc": "SPA博客没任何优化的时候，打包后会加载一个1.5M的JS(我的天吶)，看不下去了所以就抽空优化了一波",
        "time": "2018-10-25 21:29:45"
      }
    ]
  },
  "read": {
    "desc": "一些杂七杂八的技术或者生活文章",
    "list": [
      {
        "title": "Git-Camp-简明Git入门-笔记记录",
        "desc": "Super popular Version Conntrol System",
        "time": "2018-04-15 11:30:26"
      },
      {
        "title": "某位小少女的作文-1",
        "desc": "一个生命从春天走过，至少它美丽过；一个生命从夏天走过，至少它辉煌过",
        "time": "2017-04-20 22:53:23"
      },
      {
        "title": "某位小少女的作文-2",
        "desc": "轻轻地打开书本，低声诵起了朱自清的《匆匆》：“燕子去了，有再来的时候...",
        "time": "2017-04-20 22:53:24"
      },
      {
        "title": "某位小少女的散文诗-1",
        "desc": "我想把耳朵，贴在溪边的小树上。听小溪清脆地演奏，听小鸟欢快地啼叫。",
        "time": "2017-04-20 22:53:25"
      },
      {
        "title": "HTTP状态码简明宝典",
        "desc": "状态码的职责是当客户端向服务端发送请求时候，描述返回的请求内容",
        "time": "2018-03-18 09:44:18"
      },
      {
        "title": "一些感想",
        "desc": "今天路上跟舍友小聊了一些，又想起了最近发生的一些事情，感触颇深",
        "time": "2018-06-04 20:21:24"
      },
      {
        "title": "关于在mac上使用vscode编写markdown出现控制字符问题",
        "desc": "如题....遇到过无数次，所以今天终于决定解决一下",
        "time": "2018-04-25 00:13:18"
      },
      {
        "title": "吐槽-学生把代码作业放到博客里有错么",
        "desc": "事情发生在我的周围，某位同学(以下称为X总)把实验课布置的课设某一阶段的代码放到了博客里",
        "time": "2018-03-19 16:25:58"
      },
      {
        "title": "在公司你应该会的git操作",
        "desc": "基础",
        "time": "2018-07-24 21:20:08"
      },
      {
        "title": "项目坑点",
        "desc": "使用Node Mvc时重定向不写在页面的js里，而是应该在router对应的controller里进行ctx.redirect，阻止多余的处理发生",
        "time": "2018-07-25 21:49:44"
      },
      {
        "title": "2018总结",
        "desc": "不知不觉2018又过去了，暑假的时候突然变成了大三的老狗内心还是有点抗拒的，大二的时候感觉未来还是遥不可及，到了大三就要好好想想以后的出路的。",
        "time": "2018-12-23 18:06:56"
      }
    ]
  },
  "review": {
    "desc": "面试经历，经验以及面试题扩展研究",
    "list": [
      {
        "title": "大二新人的一次搜狐前端实习电面",
        "desc": "暑假想找一份实习，碰巧看到了学长的搜狐内推，就把自己的没有诚意的简历投了过去",
        "time": "2018-04-13 00:10:35"
      },
      {
        "title": "一道简单面试题理解JS事件机制(+1白话讲解)",
        "desc": "一个进程在执行某个请求的时候，若该请求需要一段时间才能返回信息，那么这个进程将会一直等待下去，直到收到返回信息才继续执行下去",
        "time": "2018-03-14 19:56:41"
      },
      {
        "title": "大二杭州有赞前端三轮面试",
        "desc": "个人感觉对杭州这个城市还是有很大好感的，正好在掘金上看到有赞的招聘，就顺势投了简历",
        "time": "2018-05-31 15:55:06"
      },
      {
        "title": "浏览器从输入URL到页面加载过程(+1白话精简讲解)",
        "desc": "这是一个很常见的问题，我们每天都在经历这件事，但是却不能说出具体的过程",
        "time": "2018-03-14 23:29:57"
      }
    ]
  },
  "ui": {
    "desc": "Css, Canvas等技术的研究以及完成的炫酷UI",
    "list": [
      {
        "title": "Canvas模仿草莓音乐节宣传视频",
        "desc": "掘金上看了一篇文章，作者使用的是导出的svg，然鹅我不会，所以我就想着用canvas撸出来...顺便当复习了",
        "time": "2018-03-27 15:15:39"
      },
      {
        "title": "CSS人人都能写自定义Checkbox(+1白话讲解)",
        "desc": "那一刻...无数前端开发者想起了自己曾经被Checkbox支配的恐惧...",
        "time": "2018-03-23 20:57:17"
      },
      {
        "title": "css垂直居中",
        "desc": "写前端的时候总是忘记垂直居中...每次都要去搜代码",
        "time": "2017-04-22 13:52:04"
      },
      {
        "title": "CSS实现文字打字动画(+1白话讲解)",
        "desc": "很多时候，我们会有一些奇怪的骚想法，比如让网页中的一些特定文本像敲代码一样一个一个显示出来...",
        "time": "2018-03-14 19:50:59"
      },
      {
        "title": "一个前端开发者的自我折磨(UI)",
        "desc": "偶然看到[一篇UI优化文章]，发现里面几个UI交互真滴不错，就自己动手撸了一下~",
        "time": "2018-04-03 20:39:24"
      },
      {
        "title": "前端开发者如何快速的把UI撸出来",
        "desc": "本文不使用任何框架 不考虑任何浏览器兼容性 不接受反驳",
        "time": "2018-05-06 22:14:16"
      },
      {
        "title": "简单CSS实现闪烁动画(+1白话讲解)",
        "desc": "本文承接自上文[《CSS实现文字打字动画（+1白话讲解）》]",
        "time": "2018-03-15 21:56:21"
      },
      {
        "title": "Css的Polyfill杂谈",
        "desc": "Css的特性和Js一样让人烦恼，前端开发者都面临着兼容各种浏览器的问题，但幸运的是这两者都有各自的解决方案",
        "time": "2018-12-14 12:30:21"
      }
    ]
  },
  "wx": {
    "desc": "微信小程序相关项目以及知识点深入",
    "list": [
      {
        "title": "微信小程序实现折叠展开菜单",
        "desc": "在这篇文章[《2018年设计趋势指南》]中发现一款菜单不错，就想着用微信小程序实现",
        "time": "2018-04-07 11:14:52"
      },
      {
        "title": "微信小程序模仿网易云音乐",
        "desc": "使用微信小程序模仿网易云音乐,接口来源于...",
        "time": "2018-03-13 12:23:58"
      },
      {
        "title": "你可能需要的一些微信小程序开发知识点",
        "desc": "一直以来进行了比较多的微信小程序开发... 总会接触到一些和官方组件或api相关或其无法解决的需求...",
        "time": "2018-05-03 19:32:12"
      }
    ]
  }
}
module.exports = mdList;